Repository: Taritsyn/MsieJavaScriptEngine
Catalog: src/MsieJavaScriptEngine/Resources/CommonStrings.*.resx
Languages: ru_ru

# Common_ArgumentHasIncorrectType
source: The parameter '{0}' must have a `{1}` type.
ru_ru: Параметр с именем "{0}" должен иметь тип `{1}`!

# Common_ArgumentIsEmpty
source: The parameter '{0}' must be a non-empty string.
ru_ru: Параметр с именем "{0}" не должен содержать пустую строку!

# Common_ArgumentIsNull
source: The parameter '{0}' must be a non-nullable.
ru_ru: Параметр с именем "{0}" не должен содержать значение равное null!

# Common_CannotConvertObjectToType
source: Cannot convert object of type `{0}` to type `{1}`.
ru_ru: Невозможно преобразовать объект типа `{0}` в тип `{1}`!

# Common_FileNotExist
source: File '{0}' not exist.
ru_ru: Файл "{0}" не существует!

# Common_ResourceIsNull
source: Resource with name '{0}' is null.
ru_ru: Ресурс с именем "{0}" содержит значение равное null!

# Common_SeeOriginalErrorMessage
source: See the original error message: “{0}”.
ru_ru: Смотри оригинальное сообщение об ошибке: «{0}».

# Common_ValueTypeCannotBeNull
source: Cannot convert null to a value type.
ru_ru: Невозможно преобразовать null в значимый тип!

# Engine_AssemblyNotRegistered
source: Most likely it happened, because the '{0}' assembly was not registered in your system.
ru_ru: Скорее всего, это произошло, потому что сборка "{0}" не была зарегистрирована в вашей системе.

# Engine_EdgeInstallationRequired
source: Try to install the Windows 10 with Edge Legacy browser.
ru_ru: Попробуйте установить Windows 10 с веб-браузером Edge Legacy.

# Engine_IeInstallationRequired
source: Try to install the Internet Explorer {0} or higher.
ru_ru: Попробуйте установить Internet Explorer {0} или выше.

# Engine_JsEngineNotLoaded
source: Failed to create instance of the MsieJsEngine in {0} mode.
ru_ru: Не удалось создать экземпляр MsieJsEngine в режиме {0}.

# Engine_MaxStackSizeMustBeNonNegative
source: Maximum stack size must be non-negative.
ru_ru: Максимальный размер стека должен быть неотрицательным!

# ErrorDetails_CallStack
source: Call stack
ru_ru: Стек вызовов

# ErrorDetails_Category
source: Category
ru_ru: Категория

# ErrorDetails_ColumnNumber
source: Column number
ru_ru: Номер столбца

# ErrorDetails_Description
source: Description
ru_ru: Описание

# ErrorDetails_DocumentName
source: Document name
ru_ru: Имя документа

# ErrorDetails_EngineMode
source: Engine mode
ru_ru: Режим движка

# ErrorDetails_LineNumber
source: Line number
ru_ru: Номер строки

# ErrorDetails_Message
source: Message
ru_ru: Сообщение об ошибке

# ErrorDetails_SourceFragment
source: Source fragment
ru_ru: Фрагмент исходного кода

# ErrorDetails_Type
source: Type
ru_ru: Тип

# Runtime_FunctionNotExist
source: The function with the name '{0}' does not exist.
ru_ru: Функция с именем "{0}" не существует!

# Runtime_HostDelegateInvocationFailed
source: During invocation of the host delegate an error has occurred - “{0}”.
ru_ru: Во время вызова делегата хоста произошла ошибка - «{0}»!

# Runtime_HostObjectFieldGettingFailed
source: During getting value of '{0}' field of the host object an error has occurred - “{1}”.
ru_ru: Во время получения значения поля "{0}" объекта хоста произошла ошибка - «{1}»!

# Runtime_HostObjectFieldSettingFailed
source: During setting value of '{0}' field of the host object an error has occurred - “{1}”.
ru_ru: Во время присваивания значения полю "{0}" объекта хоста произошла ошибка - «{1}»!

# Runtime_HostObjectMethodInvocationFailed
source: During invocation of '{0}' method of the host object an error has occurred - “{1}”.
ru_ru: Во время вызова метода "{0}" объекта хоста произошла ошибка - «{1}»!

# Runtime_HostObjectPropertyGettingFailed
source: During getting value of '{0}' property of the host object an error has occurred - “{1}”.
ru_ru: Во время получения значения свойства "{0}" объекта хоста произошла ошибка - «{1}»!

# Runtime_HostObjectPropertySettingFailed
source: During setting value of '{0}' property of the host object an error has occurred - “{1}”.
ru_ru: Во время присваивания значения свойству "{0}" объекта хоста произошла ошибка - «{1}»!

# Runtime_HostTypeConstructorInvocationFailed
source: During invocation of constructor of the `{0}` host type an error has occurred - “{1}”.
ru_ru: Во время вызова конструктора типа хоста `{0}` произошла ошибка - «{1}»!

# Runtime_HostTypeConstructorNotFound
source: Could not create instance of the `{0}` host type, because it does not have any public constructor.
ru_ru: Не удается создать экземпляр типа хоста `{0}`, потому что он не имеет ни одного публичного конструктора!

# Runtime_HostTypeFieldGettingFailed
source: During getting value of '{0}' field of the `{1}` host type an error has occurred - “{2}”.
ru_ru: Во время получения значения поля "{0}" типа хоста `{1}` произошла ошибка - «{2}»!

# Runtime_HostTypeFieldSettingFailed
source: During setting value of '{0}' field of the `{1}` host type an error has occurred - “{2}”.
ru_ru: Во время присваивания значения полю "{0}" типа хоста `{1}` произошла ошибка - «{2}»!

# Runtime_HostTypeMethodInvocationFailed
source: During invocation of '{0}' method of the `{1}` host type an error has occurred - “{2}”.
ru_ru: Во время вызова метода "{0}" типа хоста `{1}` произошла ошибка - «{2}»!

# Runtime_HostTypePropertyGettingFailed
source: During getting value of '{0}' property of the `{1}` host type an error has occurred - “{2}”.
ru_ru: Во время получения значения свойства "{0}" типа хоста `{1}` произошла ошибка - «{2}»!

# Runtime_HostTypePropertySettingFailed
source: During setting value of '{0}' property of the host type `{1}` an error has occurred - “{2}”.
ru_ru: Во время присваивания значения свойству "{0}" типа хоста `{1}` произошла ошибка - «{2}»!

# Runtime_InvalidCallStackLineFormat
source: The '{0}' line of the script call stack has an incorrect format.
ru_ru: Строка стека вызовов скрипта "{0}" имеет некорректный формат!

# Runtime_InvalidThisContextForHostObjectField
source: Could not retrieve field '{0}' of the host object, because there was an invalid `this` context.
ru_ru: Не удалось получить поле "{0}" объекта хоста, потому что контекст `this` недействителен!

# Runtime_InvalidThisContextForHostObjectMethod
source: Could not call method '{0}' of the host object, because there was an invalid `this` context.
ru_ru: Не удалось вызвать метод "{0}" объекта хоста, потому что контекст `this` недействителен!

# Runtime_InvalidThisContextForHostObjectProperty
source: Could not retrieve property '{0}' of the host object, because there was an invalid `this` context.
ru_ru: Не удалось получить свойство "{0}" объекта хоста, потому что контекст `this` недействителен!

# Runtime_ScriptInterrupted
source: Script execution was interrupted.
ru_ru: Выполнение скрипта было прервано!

# Runtime_SuitableConstructorOfHostTypeNotFound
source: Could not find suitable constructor or not enough arguments to invoke of constructor of the `{0}` host type.
ru_ru: Не получается найти подходящий конструктор или не хватает аргументов для вызова конструктора `{0}` типа хоста!

# Runtime_SuitableMethodOfHostObjectNotFound
source: Could not find suitable method or not enough arguments to invoke of '{0}' method of the host object.
ru_ru: Не получается найти подходящий метод или не хватает аргументов для вызова метода "{0}" объекта хоста!

# Usage_CannotExecuteEmptyFile
source: Сannot execute a '{0}' file, because it is empty.
ru_ru: Нельзя выполнить файл "{0}", потому что он пустой!

# Usage_CannotExecuteEmptyResource
source: Сannot execute a '{0}' resource, because it is empty.
ru_ru: Нельзя выполнить ресурс "{0}", потому что он пустой!

# Usage_CannotExecutePrecompiledScriptForAnotherJsEngineMode
source: Сannot execute a pre-compiled script, because it was created for another mode with name `{0}`.
ru_ru: Нельзя выполнить предварительно скомпилированный сценарий, потому что он был создан для другого режима с именем `{0}`!

# Usage_CannotPrecompileEmptyFile
source: Сannot pre-compile a '{0}' file, because it is empty.
ru_ru: Нельзя произвести предварительную компиляцию файла "{0}", потому что он пустой!

# Usage_CannotPrecompileEmptyResource
source: Сannot pre-compile a '{0}' resource, because it is empty.
ru_ru: Нельзя произвести предварительную компиляцию ресурса "{0}", потому что он пустой!

# Usage_EmbeddedHostObjectTypeNotSupported
source: The embedded host object '{0}' has a type `{1}`, which is not supported.
ru_ru: Встраиваемый объекта хоста "{0}" имеет тип `{1}`, который не поддерживается!

# Usage_EmbeddedHostTypeNotSupported
source: The embedded host type `{0}` is not supported.
ru_ru: Встраиваемый тип хоста `{0}` не поддерживается!

# Usage_FunctionParameterTypeNotSupported
source: One of the function parameters '{0}' has a type `{1}`, which is not supported.
ru_ru: Один из параметров функции "{0}" имеет тип `{1}`, который не поддерживается!

# Usage_InvalidDocumentNameFormat
source: The document name '{0}' has incorrect format.
ru_ru: Имя документа "{0}" имеет некорректный формат!

# Usage_InvalidFileNameFormat
source: The file name '{0}' has incorrect format.
ru_ru: Имя файла "{0}" имеет некорректный формат!

# Usage_InvalidFunctionNameFormat
source: The function name '{0}' has incorrect format.
ru_ru: Имя функции "{0}" имеет некорректный формат!

# Usage_InvalidResourceNameFormat
source: The resource name '{0}' has incorrect format.
ru_ru: Имя ресурса "{0}" имеет некорректный формат!

# Usage_InvalidScriptItemNameFormat
source: The script item name '{0}' has incorrect format.
ru_ru: Имя скриптового элемента "{0}" имеет некорректный формат!

# Usage_InvalidVariableNameFormat
source: The variable name '{0}' has incorrect format.
ru_ru: Имя переменной "{0}" имеет некорректный формат!

# Usage_JsEngineModeNotSupported
source: Selected '{0}' mode of JavaScript engine is not supported.
ru_ru: Выбранный вами режим JavaScript-движка "{0}" не поддерживается!

# Usage_JsEnginesConflictInProcess
source: It is prohibited to use the {0} and {1} engines in one process.
ru_ru: Нельзя использовать {0} и {1} движки в одном процессе.

# Usage_ReturnValueTypeNotSupported
source: The type of return value `{0}` is not supported.
ru_ru: Тип возвращаемого значения `{0}` не поддерживается!

# Usage_VariableTypeNotSupported
source: The variable '{0}' has a type `{1}`, which is not supported.
ru_ru: Переменная "{0}" имеет тип `{1}`, который не поддерживается!
